.sample-xml/query-block-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fcub="http://fcubs.ofss.com/service/FCUBSCustomerService">
   <soapenv:Header/>
   <soapenv:Body>
      <fcub:QUERYAMTBLK_IOFS_REQ>
         <fcub:FCUBS_HEADER>
            <fcub:SOURCE>SMFBPORTAL</fcub:SOURCE>
            <fcub:UBSCOMP>FCUBS</fcub:UBSCOMP>
            <fcub:USERID>SYSTEM</fcub:USERID>
            <fcub:BRANCH>001</fcub:BRANCH>
            <fcub:SERVICE>FCUBSCustomerService</fcub:SERVICE>
            <fcub:OPERATION>QueryAmtBlk</fcub:OPERATION>
         </fcub:FCUBS_HEADER>
         <fcub:FCUBS_BODY>
            <fcub:Amount-Blocks-IO>
               <fcub:AMTBLKNO>TEST0001</fcub:AMTBLKNO>
            </fcub:Amount-Blocks-IO>
         </fcub:FCUBS_BODY>
      </fcub:QUERYAMTBLK_IOFS_REQ>
   </soapenv:Body>
</soapenv:Envelope>